[
  {
    "index": 0,
    "title": "I siti accessibili sono brutti",
    "description": "Un sito web accessibile non è obbligatoriamente brutto perché l'accessibilità si concentra sulla facilità di utilizzo per tutte le persone, comprese quelle con disabilità. Un sito web ben progettato e accessibile può essere esteticamente gradevole e funzionale allo stesso tempo, offrendo una migliore esperienza utente per tutti."
  },
  {
    "index": 1,
    "title": "Il mio sito non verrà mai visitato da...",
    "description": "Milioni di persone con disabilità utilizzano Internet in tutto il mondo. Questo numero varia a seconda della regione e del tipo di disabilità, ma le tecnologie accessibili e gli strumenti di assistenza hanno reso Internet un mezzo fondamentale per la comunicazione, l'informazione e l'inclusione sociale per molte persone con disabilità."
  },
  {
    "index": 2,
    "title": "Basta aggiungere gli alt alle immagini",
    "description": "Fornire solo alternative testuali alle immagini è un passo importante per rendere un sito web più accessibile, ma non è sufficiente per renderlo pienamente accessibile per tutti."
  },
  {
    "index": 3,
    "title": "Alle aziende non interessa l'accessibilità",
    "description": "Non è vero che alle aziende non interessa l'accessibilità dei servizi e dei prodotti digitali perché l'accessibilità può portare a una più ampia base di clienti, evitare rischi legali, migliorare la reputazione aziendale, dimostrare impegno verso la diversità e l'inclusione, e promuovere l'innovazione e l'efficienza interna."
  },
  {
    "index": 4,
    "title": "Un sito dinamico non può essere accessibile",
    "description": "Un sito che dinamico, che prevede frequenti interazioni da parte dell'utente, può essere totalmente accessibile se progettato tenendo conto delle esigenze di tutte le persone, comprese quelle con disabilità. Ciò implica la progettazione di un'interfaccia intuitiva, la possibilità di navigare e interagire con il sito tramite tastiera o altri dispositivi, la piena compatibilità con screen reader e altre tecnologie assistive, garantendo così che tutti gli utenti possano partecipare in modo completo ed efficace senza barriere."
  },
  {
    "index": 5,
    "title": "Basta utilizzare colori ad alto contrasto",
    "description": "Per rendere un sito accessibile non basta utilizzare colori ad alto contrasto perché l'accessibilità coinvolge molteplici aspetti, come la navigazione con la tastiera, il testo alternativo per le immagini, la struttura logica del contenuto, la sua chiarezza e molto altro. Tutti questi aspetti devono essere considerati per soddisfare le esigenze di utenti con disabilità di diverse tipologie e per migliorare l'esperienza utente di tutti."
  },
  {
    "index": 6,
    "title": "L'accessibilità riguarda solo persone con difetti alla vista",
    "description": "L'accessibilità dei siti web è rivolta a tutte le persone, incluse le persone con disabilità visive, uditive, motorie o cognitive. L'obiettivo è garantire che tutti gli utenti, indipendentemente dalle loro capacità, possano accedere, navigare e interagire in modo efficace con il contenuto e le funzionalità dei siti web, promuovendo l'inclusione digitale e l'uguaglianza di accesso alle informazioni per tutti."
  }
]
